{
  "basics": {
    "name": "Austin McConnell",
    "label": "Software Engineer",
    "picture": "img/austin_profile_sparkcognition.png",
    "email": "austin@austinmcconnell.dev",
    "phone": "469-441-4199",
    "website": "https://austinmcconnell.dev",
    "summary": "I build performant web apps, REST APIs, and ETL Pipelines. I emphasize clean, maintainable code with a focus on readability and language-specific best practices. I build fully-automated CI/CD pipelines and I practice infrastructure-as-code. I have held a security clearance from the US government.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Cedar Park",
      "countryCode": "US",
      "region": "TX"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "austinmcconnell",
        "url": "https://github.com/austinmcconnell"
      },
      {
        "network": "LinkedIn",
        "username": "austinmcconnell",
        "url": "https://www.linkedin.com/in/austinmcconnell"
      }
    ]
  },
  "work": [
    {
      "company": "SparkCognition",
      "position": "Senior Software Engineer",
      "location": "Austin, TX",
      "website": "https://sparkcognition.com",
      "startDate": "2019-10-28",
      "endDate": "2022-11-02",
      "summary": "Guided architectural decisions, reduced operating costs, and improved developer efficiency across two core products (DeepNLP and ML Studio).",
      "highlights": [
        "Designed and implemented a job processing and queueing system to parallelize document ingestions and transformations.",
        "Reduced time to onboard a new customer from 6 weeks to 2 days, a 95% decrease, using Helmsman.",
        "Guided techincal architecture decisions for the company while on the Architecture Council.",
        "Led the creation of a web API standard to ensure a consistent user experience across all our services.",
        "Removed 5000+ lines of unused code to clean up a core product and increase readability & maintainability.",
        "Implemented team coding standards to improve code readability and increase developer efficiency."
      ]
    },
    {
      "company": "Real Massive",
      "position": "Full Stack Engineer",
      "location": "Austin, TX",
      "website": "https://realmassive.com",
      "startDate": "2017-05-22",
      "endDate": "2019-10-25",
      "summary": "Joined RealMassive to improve the existing application development/deployment process and environment.",
      "highlights": [
        "Built and deployed an ETL pipeline in Python that can process 3.6 Million records per day.",
        "Saved company 50k per year by optimizing infrastructure needs and application memory/cpu requirements",
        "Reduced Docker image sizes by 400% by restructuring existing containers using best practices.",
        "Co-led backend development effort for a major redesign of products and platform. Closely worked with the Product Owner to define and clarify requirements.",
        "Created and maintained fully automated CI/CD pipelines for code deployment using CircleCI.",
        "Maintained existing and deployed new microservices using Kubernetes, Terraform, and Helm for repeatable infrastructure deployments across multiple environments.",
        "Designed a new database model schema for an ingestion pipeline based on product requirements.",
        "Implemented tooling to improve developer velocity using git pre-commit hooks. These hooks automatically perform 15+ checks that ensure code meets development standards which reduces subjectivity in PRs and increases maintainability of our code bases."
      ]
    },
    {
      "company": "Lockheed Martin",
      "position": "Modeling & Analysis Engineer",
      "location": "Fort Worth, TX",
      "website": "http://lockheedmartin.com",
      "startDate": "2014-06-14",
      "endDate": "2017-04-28",
      "summary": "Joined Lockheed Martin Modeling & Analysis team to lead global aircraft logistics simulation effort. Obtained a government security clearance.",
      "highlights": [
        "Youngest Study Lead ever for government contract deliverable. Output from the deliverable was used to directly support negotiation of a $1.9B annualized contract.",
        "Successfully decreased the time and cost to produce contract deliverable by 90% by fully automating the simulation, analysis, and report generation process.",
        "Created a multi-threaded, multi-processing agent-based file watcher program in Python for automation of simulation post-processing. Multiple pipelines stored processed results in a variety of formats and databases.",
        "Primary modeler in charge of massive 10-year global simulation which included planned squadron size and flight hours for US and partner countries, planned and actual spare part purchases, and engineered and actual failure rates for thousands of parts."
      ]
    },
    {
      "ignore": true,
      "company": "Lockheed Martin",
      "position": "Subsystems Integrity and Force Life Management Engineer",
      "website": "http://lockheedmartin.com",
      "startDate": "2012-01-16",
      "endDate": "2014-06-14",
      "summary": "Lockheed Martin is a global aerospace company that is principally engaged in the research, design, development, manufacture, integration, and sustainment of military aircraft.",
      "highlights": [
        "Wrote custom software to automatically detect and parse raw aircraft flight data and store the results in a database.",
        "Provided code design and data analysis for 6 part utilization reports.",
        "Applied statistical analysis to multiple dataset formats and used goodness-of-fit parameters to determine best curve fit option.",
        "Created Access database and reports to manage limited-life part inspection requirements.",
        "Reviewed qualification requirements and test reports for 4 F-35 subsystems."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "Texas A&M University",
      "location": "College Station, TX",
      "area": "Aerospace Engineering",
      "studyType": "Bachelor of Science",
      "startDate": "2006-08-01",
      "endDate": "2011-12-01",
      "courses": []
    }
  ],
  "awards":[],
  "publications": [],
  "skills": [
    {
      "name": "",
      "level": "",
      "keywords": [
        "Python",
        "Docker",
        "Kubernetes",
        "PostgreSQL",
        "Terraform",
        "Azure",
        "Amazon Web Services (AWS)",
        "Google Cloud Platform (GCP)",
        "Flask",
        "SQLAlchemy",
        "FastAPI",
        "SQL",
        "Git",
        "CircleCI"
      ]
    }
  ],
  "languages": [],
  "interests": []
}
